In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

In [2]:
dat1 = pd.read_csv("3rd_ppp_for_upload_win.csv", encoding = "ISO-8859-1")
dat2 = pd.read_csv("atm_for_upload_win.csv", encoding = "ISO-8859-1")
dat3 = pd.read_csv("banks_for_upload_win.csv", encoding = "ISO-8859-1")
dat4 = pd.read_csv("bus_stands_for_upload_win.csv", encoding = "ISO-8859-1")
dat5 = pd.read_csv("microfinance_for_upload_win.csv", encoding = "ISO-8859-1")
dat6 = pd.read_csv("mobilemoney_agents_for_upload_win.csv", encoding = "ISO-8859-1")
dat7 = pd.read_csv("pos_for_upload_win.csv", encoding = "ISO-8859-1")
dat8 = pd.read_csv("post_office_for_upload_win.csv", encoding = "ISO-8859-1")
dat9 = pd.read_csv("sacco_for_upload_win.csv", encoding = "ISO-8859-1")

c:\users\olaleye eniola\anaconda3\lib\site-packages\IPython\core\interactiveshell.py:2728: DtypeWarning: Columns (26,32,33,42,74) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [3]:
dat1 = dat1[['region', 'district', 'ward', 'latitude', 'longitude']]
dat2 = dat2[['region', 'district', 'ward', 'latitude', 'longitude']]
dat3 = dat3[['region', 'district', 'ward', 'latitude', 'longitude']]
dat4 = dat4[['region', 'district', 'ward', 'latitude', 'longitude']]
dat5 = dat5[['region', 'district', 'ward', 'latitude', 'longitude']]
dat6 = dat6[['region', 'district', 'ward', 'latitude', 'longitude']]
dat7 = dat7[['region', 'district', 'ward', 'latitude', 'longitude']]
dat8 = dat8[['region', 'district', 'ward', 'latitude', 'longitude']]
dat9 = dat9[['region', 'district', 'ward', 'latitude', 'longitude']]

In [4]:
data = pd.concat([dat1,dat2,dat3,dat4,dat5,dat6,dat7,dat8,dat9])

In [5]:
data.to_csv("all.csv",index = False)

In [6]:
data.head()

          region   district         ward  latitude  longitude
0         Mwanza       Magu     Nyanguge  -2.36921   33.57654
1         Mwanza    Ilemela      Nyakato  -2.53201   32.94780
2  Dar es Salaam      Ilala      Segerea  -6.84188   39.21102
3  Dar es Salaam  Kinondoni  Kijitonyama  -6.77949   39.24092
4  Dar es Salaam     Temeke    Kigamboni  -6.82792   39.31021

In [7]:
data.isnull().sum()

region       20
district     19
ward         19
latitude      0
longitude     0
dtype: int64

In [8]:
data.dropna(inplace = True)

In [9]:
data.reset_index(inplace = True)

In [10]:
data.drop("index", axis = 1 ,inplace = True)

In [11]:
data.head()

          region   district         ward  latitude  longitude
0         Mwanza       Magu     Nyanguge  -2.36921   33.57654
1         Mwanza    Ilemela      Nyakato  -2.53201   32.94780
2  Dar es Salaam      Ilala      Segerea  -6.84188   39.21102
3  Dar es Salaam  Kinondoni  Kijitonyama  -6.77949   39.24092
4  Dar es Salaam     Temeke    Kigamboni  -6.82792   39.31021

In [12]:
dataOriginal = data.copy()

In [14]:
data.region.nunique()

22

In [15]:
data['region'] = data['region'].astype('category')

In [16]:
-4.46044192,29.8113964

(-4.46044192, 29.8113964)

In [17]:
data.nunique()

region          22
district       124
ward          1383
latitude     40399
longitude    41000
dtype: int64

In [18]:
#data['district'] = data['district'].astype('category')

data.drop_duplicates(inplace =True)
data.reset_index(inplace = True)
data.drop("index", axis = 1 ,inplace = True)

In [19]:
data.head()

          region   district         ward  latitude  longitude
0         Mwanza       Magu     Nyanguge  -2.36921   33.57654
1         Mwanza    Ilemela      Nyakato  -2.53201   32.94780
2  Dar es Salaam      Ilala      Segerea  -6.84188   39.21102
3  Dar es Salaam  Kinondoni  Kijitonyama  -6.77949   39.24092
4  Dar es Salaam     Temeke    Kigamboni  -6.82792   39.31021

In [20]:
data[data["latitude"] == -2.36921]

   region district      ward  latitude  longitude
0  Mwanza     Magu  Nyanguge  -2.36921   33.57654

In [22]:
data.dtypes

region       category
district       object
ward           object
latitude      float64
longitude     float64
dtype: object

In [23]:

cat_columns = data.select_dtypes(['category']).columns

cat_columns
data[cat_columns] = data[cat_columns].apply(lambda x: x.cat.codes)
data.head()

   region   district         ward  latitude  longitude
0      13       Magu     Nyanguge  -2.36921   33.57654
1      13    Ilemela      Nyakato  -2.53201   32.94780
2       1      Ilala      Segerea  -6.84188   39.21102
3       1  Kinondoni  Kijitonyama  -6.77949   39.24092
4       1     Temeke    Kigamboni  -6.82792   39.31021

In [24]:
data.district.nunique()

124

In [25]:
X= data.drop(["district","region","ward"], axis =1)
y = data["region"]

In [26]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split( X, y, test_size=0.3, random_state=42)

In [27]:
from xgboost import XGBClassifier
from sklearn.linear_model import LogisticRegression
from sklearn.ensemble import RandomForestClassifier

c:\users\olaleye eniola\anaconda3\lib\site-packages\sklearn\ensemble\weight_boosting.py:29: DeprecationWarning: numpy.core.umath_tests is an internal NumPy module and should not be imported. It will be removed in a future NumPy release.
  from numpy.core.umath_tests import inner1d

In [28]:
model = LogisticRegression()
rf = RandomForestClassifier()
xgb = XGBClassifier()

In [29]:
y_train.head()

49627    11
39556    17
11248     8
27827     1
10709    14
Name: region, dtype: int8

In [30]:
model.fit(X_train,y_train)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
          intercept_scaling=1, max_iter=100, multi_class='ovr', n_jobs=1,
          penalty='l2', random_state=None, solver='liblinear', tol=0.0001,
          verbose=0, warm_start=False)

In [31]:
rf.fit(X_train,y_train)

RandomForestClassifier(bootstrap=True, class_weight=None, criterion='gini',
            max_depth=None, max_features='auto', max_leaf_nodes=None,
            min_impurity_decrease=0.0, min_impurity_split=None,
            min_samples_leaf=1, min_samples_split=2,
            min_weight_fraction_leaf=0.0, n_estimators=10, n_jobs=1,
            oob_score=False, random_state=None, verbose=0,
            warm_start=False)

In [32]:
xgb.fit(X_train,y_train)

XGBClassifier(base_score=0.5, booster='gbtree', colsample_bylevel=1,
       colsample_bytree=1, gamma=0, learning_rate=0.1, max_delta_step=0,
       max_depth=3, min_child_weight=1, missing=None, n_estimators=100,
       n_jobs=1, nthread=None, objective='multi:softprob', random_state=0,
       reg_alpha=0, reg_lambda=1, scale_pos_weight=1, seed=None,
       silent=True, subsample=1)

In [33]:
X_train.head()

       latitude  longitude
49627  -6.80937   37.69184
39556  -3.82783   32.59622
11248  -4.18991   35.02281
27827  -6.76761   39.21725
10709  -7.36417   39.06662

In [34]:
model.predict(X_test)

array([1, 1, 1, ..., 1, 1, 0], dtype=int8)

In [35]:
from sklearn.metrics import accuracy_score

In [36]:
accuracy_score(xgb.predict(X_test),y_test)

c:\users\olaleye eniola\anaconda3\lib\site-packages\sklearn\preprocessing\label.py:151: DeprecationWarning: The truth value of an empty array is ambiguous. Returning False, but in future this will result in an error. Use `array.size > 0` to check that an array is not empty.
  if diff:

0.9890778871978514

In [37]:
accuracy_score(rf.predict(X_test),y_test)

0.9884810504327066

In [38]:
xgb.fit(X,y)

XGBClassifier(base_score=0.5, booster='gbtree', colsample_bylevel=1,
       colsample_bytree=1, gamma=0, learning_rate=0.1, max_delta_step=0,
       max_depth=3, min_child_weight=1, missing=None, n_estimators=100,
       n_jobs=1, nthread=None, objective='multi:softprob', random_state=0,
       reg_alpha=0, reg_lambda=1, scale_pos_weight=1, seed=None,
       silent=True, subsample=1)

In [39]:
dataOriginal.head()
#data[data["district"]==53]

          region   district         ward  latitude  longitude
0         Mwanza       Magu     Nyanguge  -2.36921   33.57654
1         Mwanza    Ilemela      Nyakato  -2.53201   32.94780
2  Dar es Salaam      Ilala      Segerea  -6.84188   39.21102
3  Dar es Salaam  Kinondoni  Kijitonyama  -6.77949   39.24092
4  Dar es Salaam     Temeke    Kigamboni  -6.82792   39.31021

In [40]:

dataOriginal['region'] = dataOriginal['region'].astype('category')

dataOriginal.drop_duplicates(inplace =True)
dataOriginal.reset_index(inplace = True)
dataOriginal.drop("index", axis = 1 ,inplace = True)
dist = dataOriginal["region"]
cat_columns = dataOriginal.select_dtypes(['category']).columns

cat_columns
dataOriginal[cat_columns] = dataOriginal[cat_columns].apply(lambda x: x.cat.codes)
dataOriginal.head()

   region   district         ward  latitude  longitude
0      13       Magu     Nyanguge  -2.36921   33.57654
1      13    Ilemela      Nyakato  -2.53201   32.94780
2       1      Ilala      Segerea  -6.84188   39.21102
3       1  Kinondoni  Kijitonyama  -6.77949   39.24092
4       1     Temeke    Kigamboni  -6.82792   39.31021

In [41]:
worked_out = pd.concat([dataOriginal["region"],dist],axis =1)

In [42]:
worked_out.head()

  region         region
0     13         Mwanza
1     13         Mwanza
2      1  Dar es Salaam
3      1  Dar es Salaam
4      1  Dar es Salaam

In [43]:
worked_out.columns = ["region",'main']

In [44]:
#worked_out[worked_out["district"] == 53]

In [45]:
train = pd.read_csv("training.csv")

In [46]:
test = pd.read_csv("test.csv")

In [47]:
train.head()

,ID,Q1,Q2,Q3,Q4,Q5,Q6,Q7,Q8_1,Q8_2,...,Q17,Q18,Q19,Latitude,Longitude,mobile_money,savings,borrowing,insurance,mobile_money_classification
0,5086,98,2,3,1,1,2,2,0,0,...,-1,4,4,-4.460442,29.811396,0,0,0,0,0
1,1258,40,1,1,3,5,1,1,1,0,...,4,1,4,-6.176438,39.244871,1,1,1,0,3
2,331,18,2,4,6,3,2,1,0,0,...,-1,1,1,-6.825702,37.652798,1,0,0,0,2
3,6729,50,1,1,3,1,1,1,0,0,...,-1,1,4,-3.372049,35.808307,1,0,1,0,3
4,8671,34,1,1,1,1,2,1,0,1,...,-1,1,4,-7.179645,31.039095,1,1,0,1,3

In [48]:
train = train[['Latitude','Longitude']]
test = test[['Latitude','Longitude']]
train.columns = ['latitude', 'longitude']
test.columns  = ['latitude', 'longitude']

In [49]:
train.head()

   latitude  longitude
0 -4.460442  29.811396
1 -6.176438  39.244871
2 -6.825702  37.652798
3 -3.372049  35.808307
4 -7.179645  31.039095

In [50]:
test.head()

   latitude  longitude
0 -2.596421  32.913584
1 -1.778303  34.062640
2 -1.851789  31.536866
3 -1.235656  34.229012
4 -7.780934  35.691878

In [51]:
train_destrict = xgb.predict(train)

c:\users\olaleye eniola\anaconda3\lib\site-packages\sklearn\preprocessing\label.py:151: DeprecationWarning: The truth value of an empty array is ambiguous. Returning False, but in future this will result in an error. Use `array.size > 0` to check that an array is not empty.
  if diff:

In [52]:
test_destrict = xgb.predict(test)

c:\users\olaleye eniola\anaconda3\lib\site-packages\sklearn\preprocessing\label.py:151: DeprecationWarning: The truth value of an empty array is ambiguous. Returning False, but in future this will result in an error. Use `array.size > 0` to check that an array is not empty.
  if diff:

In [269]:
#pd.DataFrame(train_destrict)

In [270]:
#dataOriginal.head()

          region   district         ward  latitude  longitude
0         Mwanza       Magu     Nyanguge  -2.36921   33.57654
1         Mwanza    Ilemela      Nyakato  -2.53201   32.94780
2  Dar es Salaam      Ilala      Segerea  -6.84188   39.21102
3  Dar es Salaam  Kinondoni  Kijitonyama  -6.77949   39.24092
4  Dar es Salaam     Temeke    Kigamboni  -6.82792   39.31021

In [271]:
#dataOriginal.reset_index(inplace=True)
#data.drop_duplicates(inplace= True)
#dataOriginal.drop("index",inplace=True)
#data.head()

          region  district         ward  latitude  longitude
0         Mwanza        53     Nyanguge  -2.36921   33.57654
1         Mwanza        21      Nyakato  -2.53201   32.94780
2  Dar es Salaam        19      Segerea  -6.84188   39.21102
3  Dar es Salaam        38  Kijitonyama  -6.77949   39.24092
4  Dar es Salaam       118    Kigamboni  -6.82792   39.31021

In [53]:
worked_out.head()

   region           main
0      13         Mwanza
1      13         Mwanza
2       1  Dar es Salaam
3       1  Dar es Salaam
4       1  Dar es Salaam

In [54]:
dict(zip(worked_out.region, worked_out.main))

{0: 'Arusha',
 1: 'Dar es Salaam',
 2: 'Dodoma',
 3: 'Iringa',
 4: 'Kagera',
 5: 'Kigoma',
 6: 'Kilimanjaro',
 7: 'Lindi',
 8: 'Manyara',
 9: 'Mara',
 10: 'Mbeya',
 11: 'Morogoro',
 12: 'Mtwara',
 13: 'Mwanza',
 14: 'Pwani',
 15: 'Rukwa',
 16: 'Ruvuma',
 17: 'Shinyanga',
 18: 'Singida',
 19: 'Tabora',
 20: 'Tanga',
 21: 'Zanzibar'}

In [56]:
dick = dict(zip(worked_out.region, worked_out.main))
dick

{0: 'Arusha',
 1: 'Dar es Salaam',
 2: 'Dodoma',
 3: 'Iringa',
 4: 'Kagera',
 5: 'Kigoma',
 6: 'Kilimanjaro',
 7: 'Lindi',
 8: 'Manyara',
 9: 'Mara',
 10: 'Mbeya',
 11: 'Morogoro',
 12: 'Mtwara',
 13: 'Mwanza',
 14: 'Pwani',
 15: 'Rukwa',
 16: 'Ruvuma',
 17: 'Shinyanga',
 18: 'Singida',
 19: 'Tabora',
 20: 'Tanga',
 21: 'Zanzibar'}

In [58]:
trainpred = pd.DataFrame(train_destrict, columns = ["region"])
testpred = pd.DataFrame(test_destrict ,  columns = ["region"])

In [59]:
trainpred = trainpred.replace({"region": dick})

In [62]:
#trainpred = pd.DataFrame(train_destrict,columns=["district"])

In [63]:
trainpred.head()

     region
0    Kigoma
1  Zanzibar
2  Morogoro
3    Arusha
4     Rukwa

In [64]:
worked_out.head()

   region           main
0      13         Mwanza
1      13         Mwanza
2       1  Dar es Salaam
3       1  Dar es Salaam
4       1  Dar es Salaam

In [65]:
#worked_out[worked_out["district"] == 28]

In [66]:
test_destrict

array([13,  9,  4, ..., 17,  9, 13], dtype=int8)

In [67]:
#testpred = pd.DataFrame(test_destrict,columns=["district"])

In [72]:
testpred = testpred.replace({"region": dick})

In [75]:
testpred.head()

   region
0  Mwanza
1    Mara
2  Kagera
3    Mara
4  Iringa

In [77]:
testpred.to_csv('testregion.csv',index = False)
trainpred.to_csv("trainpred.csv",index = False)